СообщенияШины/src/ExternalDataProcessors/СообщенияШины/СообщенияШины.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ExternalDataProcessor>
  <name>СообщенияШины</name>
  <attributes>
    <name>СервисИнтеграции</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КаналСервисаИнтеграции</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СообщенияШины</name>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Сообщение</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Отправитель</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Получатель</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РазмерТела</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отправлено</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Устареет</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Запрос</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Параметры</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Метод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторОбъекта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Версия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипСодержимого</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ExternalDataProcessor>

СообщенияШины/src/ExternalDataProcessors/СообщенияШины/Forms/ФормаСоздания/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.СервисИнтеграции = Параметры.СервисИнтеграции;
	Объект.КаналСервисаИнтеграции = Параметры.КаналСервисаИнтеграции;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)


КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Отправить(Команда)
	ОтправитьСообщениеНаСервере();
	ОповеститьОЗаписиНового(Неопределено);
	ЭтотОбъект.Закрыть();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


&НаСервере
Процедура ОтправитьСообщениеНаСервере()
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;

	Интеграция = СервисыИнтеграции[Объект.СервисИнтеграции];
	
	ОтправляемоеСообщение = Интеграция.СоздатьСообщение();
	ОтправляемоеСообщение.КодОтправителя = ЭтотОбъект.КодОтправителя;
	ОтправляемоеСообщение.КодПолучателя = ЭтотОбъект.КодПолучателя;

	Для Каждого Параметр Из ПараметрыСообщения Цикл
		ОтправляемоеСообщение.Параметры.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ТелоСообщения) Тогда
		ОтправляемыйПоток = ОтправляемоеСообщение.ПолучитьТелоКакПоток();
		ТелоБуфером = ПолучитьБуферДвоичныхДанныхИзСтроки(ТелоСообщения);
		ОтправляемыйПоток.Записать(ТелоБуфером, 0, ТелоБуфером.Размер);
		ОтправляемыйПоток.СброситьБуферы();
		ОтправляемыйПоток.Закрыть();
	КонецЕсли;
	
	Интеграция[Объект.КаналСервисаИнтеграции].ОтправитьСообщение(ОтправляемоеСообщение);	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТелоСообщенияСтрокой(Знач Сообщение)

	Если Сообщение.РазмерТела = 0 Тогда
		РазмерБуфера = 1024;
	Иначе
		РазмерБуфера = Сообщение.РазмерТела;
	КонецЕсли;
	
	Тело  = Новый БуферДвоичныхДанных(0);
	Буфер = Новый БуферДвоичныхДанных(РазмерБуфера);
	Поток = Сообщение.ПолучитьТелоКакПоток();
	
	Пока Истина Цикл
		Прочитано = Поток.Прочитать(Буфер, 0, РазмерБуфера);
		Если Прочитано > 0 Тогда
			Тело = Тело.Соединить(Буфер);  
		КонецЕсли;
		Если Прочитано < РазмерБуфера Тогда
			Прервать; 
		КонецЕсли; 
	КонецЦикла;
	
	ТелоСтрокой = ПолучитьСтрокуИзБуфераДвоичныхДанных(Тело);
	Возврат ТелоСтрокой;

КонецФункции

&НаСервере
Процедура ЗаполнитьКаналы()
	
	Элементы.КаналСервисаИнтеграции.СписокВыбора.Очистить();
	Если НЕ ЗначениеЗаполнено(Объект.СервисИнтеграции) Тогда
		Возврат;
	КонецЕсли;
	Для Каждого ОбъектМетаданных Из Метаданные.СервисыИнтеграции[Объект.СервисИнтеграции].КаналыСервисаИнтеграции Цикл
		Элементы.КаналСервисаИнтеграции.СписокВыбора.Добавить(ОбъектМетаданных.Имя, ОбъектМетаданных.Синоним); 
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
